espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST2_REG register
 *  Events trigger status register
 */
#define SOC_ETM_EVT_ST2_REG (DR_REG_SOC_ETM_BASE + 0x1b8)
/** SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER0_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents LEDC1_evt_time_ovf_timer0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER0_ST    (BIT(0))
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER0_ST_M  (SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER0_ST_V << SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER0_ST_S)
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER0_ST_V  0x00000001U
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER0_ST_S  0
/** SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER1_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents LEDC1_evt_time_ovf_timer1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER1_ST    (BIT(1))
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER1_ST_M  (SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER1_ST_V << SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER1_ST_S)
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER1_ST_V  0x00000001U
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER1_ST_S  1
/** SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER2_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents LEDC1_evt_time_ovf_timer2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER2_ST    (BIT(2))
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER2_ST_M  (SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER2_ST_V << SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER2_ST_S)
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER2_ST_V  0x00000001U
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER2_ST_S  2
/** SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER3_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents LEDC1_evt_time_ovf_timer3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER3_ST    (BIT(3))
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER3_ST_M  (SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER3_ST_V << SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER3_ST_S)
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER3_ST_V  0x00000001U
#define SOC_ETM_LEDC1_EVT_TIME_OVF_TIMER3_ST_S  3
/** SOC_ETM_LEDC1_EVT_TIMER0_CMP_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents LEDC1_evt_timer0_cmp trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC1_EVT_TIMER0_CMP_ST    (BIT(4))
#define SOC_ETM_LEDC1_EVT_TIMER0_CMP_ST_M  (SOC_ETM_LEDC1_EVT_TIMER0_CMP_ST_V << SOC_ETM_LEDC1_EVT_TIMER0_CMP_ST_S)
#define SOC_ETM_LEDC1_EVT_TIMER0_CMP_ST_V  0x00000001U
#define SOC_ETM_LEDC1_EVT_TIMER0_CMP_ST_S  4
/** SOC_ETM_LEDC1_EVT_TIMER1_CMP_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents LEDC1_evt_timer1_cmp trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC1_EVT_TIMER1_CMP_ST    (BIT(5))
#define SOC_ETM_LEDC1_EVT_TIMER1_CMP_ST_M  (SOC_ETM_LEDC1_EVT_TIMER1_CMP_ST_V << SOC_ETM_LEDC1_EVT_TIMER1_CMP_ST_S)
#define SOC_ETM_LEDC1_EVT_TIMER1_CMP_ST_V  0x00000001U
#define SOC_ETM_LEDC1_EVT_TIMER1_CMP_ST_S  5
/** SOC_ETM_LEDC1_EVT_TIMER2_CMP_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents LEDC1_evt_timer2_cmp trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC1_EVT_TIMER2_CMP_ST    (BIT(6))
#define SOC_ETM_LEDC1_EVT_TIMER2_CMP_ST_M  (SOC_ETM_LEDC1_EVT_TIMER2_CMP_ST_V << SOC_ETM_LEDC1_EVT_TIMER2_CMP_ST_S)
#define SOC_ETM_LEDC1_EVT_TIMER2_CMP_ST_V  0x00000001U
#define SOC_ETM_LEDC1_EVT_TIMER2_CMP_ST_S  6
/** SOC_ETM_LEDC1_EVT_TIMER3_CMP_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents LEDC1_evt_timer3_cmp trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LEDC1_EVT_TIMER3_CMP_ST    (BIT(7))
#define SOC_ETM_LEDC1_EVT_TIMER3_CMP_ST_M  (SOC_ETM_LEDC1_EVT_TIMER3_CMP_ST_V << SOC_ETM_LEDC1_EVT_TIMER3_CMP_ST_S)
#define SOC_ETM_LEDC1_EVT_TIMER3_CMP_ST_V  0x00000001U
#define SOC_ETM_LEDC1_EVT_TIMER3_CMP_ST_S  7
/** SOC_ETM_TG0_EVT_CNT_CMP_TIMER0_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents TG0_evt_cnt_cmp_timer0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG0_EVT_CNT_CMP_TIMER0_ST    (BIT(8))
#define SOC_ETM_TG0_EVT_CNT_CMP_TIMER0_ST_M  (SOC_ETM_TG0_EVT_CNT_CMP_TIMER0_ST_V << SOC_ETM_TG0_EVT_CNT_CMP_TIMER0_ST_S)
#define SOC_ETM_TG0_EVT_CNT_CMP_TIMER0_ST_V  0x00000001U
#define SOC_ETM_TG0_EVT_CNT_CMP_TIMER0_ST_S  8
/** SOC_ETM_TG0_EVT_CNT_CMP_TIMER1_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents TG0_evt_cnt_cmp_timer1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG0_EVT_CNT_CMP_TIMER1_ST    (BIT(9))
#define SOC_ETM_TG0_EVT_CNT_CMP_TIMER1_ST_M  (SOC_ETM_TG0_EVT_CNT_CMP_TIMER1_ST_V << SOC_ETM_TG0_EVT_CNT_CMP_TIMER1_ST_S)
#define SOC_ETM_TG0_EVT_CNT_CMP_TIMER1_ST_V  0x00000001U
#define SOC_ETM_TG0_EVT_CNT_CMP_TIMER1_ST_S  9
/** SOC_ETM_TG1_EVT_CNT_CMP_TIMER0_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents TG1_evt_cnt_cmp_timer0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG1_EVT_CNT_CMP_TIMER0_ST    (BIT(10))
#define SOC_ETM_TG1_EVT_CNT_CMP_TIMER0_ST_M  (SOC_ETM_TG1_EVT_CNT_CMP_TIMER0_ST_V << SOC_ETM_TG1_EVT_CNT_CMP_TIMER0_ST_S)
#define SOC_ETM_TG1_EVT_CNT_CMP_TIMER0_ST_V  0x00000001U
#define SOC_ETM_TG1_EVT_CNT_CMP_TIMER0_ST_S  10
/** SOC_ETM_TG1_EVT_CNT_CMP_TIMER1_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents TG1_evt_cnt_cmp_timer1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_TG1_EVT_CNT_CMP_TIMER1_ST    (BIT(11))
#define SOC_ETM_TG1_EVT_CNT_CMP_TIMER1_ST_M  (SOC_ETM_TG1_EVT_CNT_CMP_TIMER1_ST_V << SOC_ETM_TG1_EVT_CNT_CMP_TIMER1_ST_S)
#define SOC_ETM_TG1_EVT_CNT_CMP_TIMER1_ST_V  0x00000001U
#define SOC_ETM_TG1_EVT_CNT_CMP_TIMER1_ST_S  11
/** SOC_ETM_SYSTIMER_EVT_CNT_CMP0_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents SYSTIMER_evt_cnt_cmp0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP0_ST    (BIT(12))
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP0_ST_M  (SOC_ETM_SYSTIMER_EVT_CNT_CMP0_ST_V << SOC_ETM_SYSTIMER_EVT_CNT_CMP0_ST_S)
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP0_ST_V  0x00000001U
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP0_ST_S  12
/** SOC_ETM_SYSTIMER_EVT_CNT_CMP1_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents SYSTIMER_evt_cnt_cmp1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP1_ST    (BIT(13))
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP1_ST_M  (SOC_ETM_SYSTIMER_EVT_CNT_CMP1_ST_V << SOC_ETM_SYSTIMER_EVT_CNT_CMP1_ST_S)
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP1_ST_V  0x00000001U
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP1_ST_S  13
/** SOC_ETM_SYSTIMER_EVT_CNT_CMP2_ST : R/WTC/SS; bitpos: [14]; default: 0;
 *  Represents SYSTIMER_evt_cnt_cmp2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP2_ST    (BIT(14))
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP2_ST_M  (SOC_ETM_SYSTIMER_EVT_CNT_CMP2_ST_V << SOC_ETM_SYSTIMER_EVT_CNT_CMP2_ST_S)
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP2_ST_V  0x00000001U
#define SOC_ETM_SYSTIMER_EVT_CNT_CMP2_ST_S  14
/** SOC_ETM_MCPWM0_EVT_TIMER0_STOP_ST : R/WTC/SS; bitpos: [15]; default: 0;
 *  Represents MCPWM0_evt_timer0_stop trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER0_STOP_ST    (BIT(15))
#define SOC_ETM_MCPWM0_EVT_TIMER0_STOP_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER0_STOP_ST_V << SOC_ETM_MCPWM0_EVT_TIMER0_STOP_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER0_STOP_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER0_STOP_ST_S  15
/** SOC_ETM_MCPWM0_EVT_TIMER1_STOP_ST : R/WTC/SS; bitpos: [16]; default: 0;
 *  Represents MCPWM0_evt_timer1_stop trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER1_STOP_ST    (BIT(16))
#define SOC_ETM_MCPWM0_EVT_TIMER1_STOP_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER1_STOP_ST_V << SOC_ETM_MCPWM0_EVT_TIMER1_STOP_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER1_STOP_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER1_STOP_ST_S  16
/** SOC_ETM_MCPWM0_EVT_TIMER2_STOP_ST : R/WTC/SS; bitpos: [17]; default: 0;
 *  Represents MCPWM0_evt_timer2_stop trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER2_STOP_ST    (BIT(17))
#define SOC_ETM_MCPWM0_EVT_TIMER2_STOP_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER2_STOP_ST_V << SOC_ETM_MCPWM0_EVT_TIMER2_STOP_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER2_STOP_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER2_STOP_ST_S  17
/** SOC_ETM_MCPWM0_EVT_TIMER0_TEZ_ST : R/WTC/SS; bitpos: [18]; default: 0;
 *  Represents MCPWM0_evt_timer0_tez trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEZ_ST    (BIT(18))
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEZ_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER0_TEZ_ST_V << SOC_ETM_MCPWM0_EVT_TIMER0_TEZ_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEZ_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEZ_ST_S  18
/** SOC_ETM_MCPWM0_EVT_TIMER1_TEZ_ST : R/WTC/SS; bitpos: [19]; default: 0;
 *  Represents MCPWM0_evt_timer1_tez trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEZ_ST    (BIT(19))
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEZ_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER1_TEZ_ST_V << SOC_ETM_MCPWM0_EVT_TIMER1_TEZ_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEZ_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEZ_ST_S  19
/** SOC_ETM_MCPWM0_EVT_TIMER2_TEZ_ST : R/WTC/SS; bitpos: [20]; default: 0;
 *  Represents MCPWM0_evt_timer2_tez trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEZ_ST    (BIT(20))
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEZ_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER2_TEZ_ST_V << SOC_ETM_MCPWM0_EVT_TIMER2_TEZ_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEZ_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEZ_ST_S  20
/** SOC_ETM_MCPWM0_EVT_TIMER0_TEP_ST : R/WTC/SS; bitpos: [21]; default: 0;
 *  Represents MCPWM0_evt_timer0_tep trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEP_ST    (BIT(21))
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEP_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER0_TEP_ST_V << SOC_ETM_MCPWM0_EVT_TIMER0_TEP_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEP_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEP_ST_S  21
/** SOC_ETM_MCPWM0_EVT_TIMER1_TEP_ST : R/WTC/SS; bitpos: [22]; default: 0;
 *  Represents MCPWM0_evt_timer1_tep trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEP_ST    (BIT(22))
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEP_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER1_TEP_ST_V << SOC_ETM_MCPWM0_EVT_TIMER1_TEP_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEP_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEP_ST_S  22
/** SOC_ETM_MCPWM0_EVT_TIMER2_TEP_ST : R/WTC/SS; bitpos: [23]; default: 0;
 *  Represents MCPWM0_evt_timer2_tep trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEP_ST    (BIT(23))
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEP_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER2_TEP_ST_V << SOC_ETM_MCPWM0_EVT_TIMER2_TEP_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEP_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEP_ST_S  23
/** SOC_ETM_MCPWM0_EVT_TIMER0_TEA_ST : R/WTC/SS; bitpos: [24]; default: 0;
 *  Represents MCPWM0_evt_timer0_tea trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEA_ST    (BIT(24))
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEA_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER0_TEA_ST_V << SOC_ETM_MCPWM0_EVT_TIMER0_TEA_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEA_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEA_ST_S  24
/** SOC_ETM_MCPWM0_EVT_TIMER1_TEA_ST : R/WTC/SS; bitpos: [25]; default: 0;
 *  Represents MCPWM0_evt_timer1_tea trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEA_ST    (BIT(25))
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEA_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER1_TEA_ST_V << SOC_ETM_MCPWM0_EVT_TIMER1_TEA_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEA_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEA_ST_S  25
/** SOC_ETM_MCPWM0_EVT_TIMER2_TEA_ST : R/WTC/SS; bitpos: [26]; default: 0;
 *  Represents MCPWM0_evt_timer2_tea trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEA_ST    (BIT(26))
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEA_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER2_TEA_ST_V << SOC_ETM_MCPWM0_EVT_TIMER2_TEA_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEA_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEA_ST_S  26
/** SOC_ETM_MCPWM0_EVT_TIMER0_TEB_ST : R/WTC/SS; bitpos: [27]; default: 0;
 *  Represents MCPWM0_evt_timer0_teb trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEB_ST    (BIT(27))
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEB_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER0_TEB_ST_V << SOC_ETM_MCPWM0_EVT_TIMER0_TEB_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEB_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER0_TEB_ST_S  27
/** SOC_ETM_MCPWM0_EVT_TIMER1_TEB_ST : R/WTC/SS; bitpos: [28]; default: 0;
 *  Represents MCPWM0_evt_timer1_teb trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEB_ST    (BIT(28))
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEB_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER1_TEB_ST_V << SOC_ETM_MCPWM0_EVT_TIMER1_TEB_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEB_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER1_TEB_ST_S  28
/** SOC_ETM_MCPWM0_EVT_TIMER2_TEB_ST : R/WTC/SS; bitpos: [29]; default: 0;
 *  Represents MCPWM0_evt_timer2_teb trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEB_ST    (BIT(29))
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEB_ST_M  (SOC_ETM_MCPWM0_EVT_TIMER2_TEB_ST_V << SOC_ETM_MCPWM0_EVT_TIMER2_TEB_ST_S)
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEB_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_TIMER2_TEB_ST_S  29
/** SOC_ETM_MCPWM0_EVT_OP0_TEA_ST : R/WTC/SS; bitpos: [30]; default: 0;
 *  Represents MCPWM0_evt_op0_tea trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_OP0_TEA_ST    (BIT(30))
#define SOC_ETM_MCPWM0_EVT_OP0_TEA_ST_M  (SOC_ETM_MCPWM0_EVT_OP0_TEA_ST_V << SOC_ETM_MCPWM0_EVT_OP0_TEA_ST_S)
#define SOC_ETM_MCPWM0_EVT_OP0_TEA_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_OP0_TEA_ST_S  30
/** SOC_ETM_MCPWM0_EVT_OP1_TEA_ST : R/WTC/SS; bitpos: [31]; default: 0;
 *  Represents MCPWM0_evt_op1_tea trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MCPWM0_EVT_OP1_TEA_ST    (BIT(31))
#define SOC_ETM_MCPWM0_EVT_OP1_TEA_ST_M  (SOC_ETM_MCPWM0_EVT_OP1_TEA_ST_V << SOC_ETM_MCPWM0_EVT_OP1_TEA_ST_S)
#define SOC_ETM_MCPWM0_EVT_OP1_TEA_ST_V  0x00000001U
#define SOC_ETM_MCPWM0_EVT_OP1_TEA_ST_S  31

