espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST6_CLR_REG register
 *  Events trigger status clear register
 */
#define SOC_ETM_EVT_ST6_CLR_REG (DR_REG_SOC_ETM_BASE + 0x1dc)
/** SOC_ETM_MCPWM2_EVT_TZ2_CBC_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_tz2_cbc trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_TZ2_CBC_ST_CLR    (BIT(0))
#define SOC_ETM_MCPWM2_EVT_TZ2_CBC_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_TZ2_CBC_ST_CLR_V << SOC_ETM_MCPWM2_EVT_TZ2_CBC_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_TZ2_CBC_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_TZ2_CBC_ST_CLR_S  0
/** SOC_ETM_MCPWM2_EVT_TZ0_OST_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_tz0_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_TZ0_OST_ST_CLR    (BIT(1))
#define SOC_ETM_MCPWM2_EVT_TZ0_OST_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_TZ0_OST_ST_CLR_V << SOC_ETM_MCPWM2_EVT_TZ0_OST_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_TZ0_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_TZ0_OST_ST_CLR_S  1
/** SOC_ETM_MCPWM2_EVT_TZ1_OST_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_tz1_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_TZ1_OST_ST_CLR    (BIT(2))
#define SOC_ETM_MCPWM2_EVT_TZ1_OST_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_TZ1_OST_ST_CLR_V << SOC_ETM_MCPWM2_EVT_TZ1_OST_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_TZ1_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_TZ1_OST_ST_CLR_S  2
/** SOC_ETM_MCPWM2_EVT_TZ2_OST_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_tz2_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_TZ2_OST_ST_CLR    (BIT(3))
#define SOC_ETM_MCPWM2_EVT_TZ2_OST_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_TZ2_OST_ST_CLR_V << SOC_ETM_MCPWM2_EVT_TZ2_OST_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_TZ2_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_TZ2_OST_ST_CLR_S  3
/** SOC_ETM_MCPWM2_EVT_CAP0_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_cap0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_CAP0_ST_CLR    (BIT(4))
#define SOC_ETM_MCPWM2_EVT_CAP0_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_CAP0_ST_CLR_V << SOC_ETM_MCPWM2_EVT_CAP0_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_CAP0_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_CAP0_ST_CLR_S  4
/** SOC_ETM_MCPWM2_EVT_CAP1_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_cap1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_CAP1_ST_CLR    (BIT(5))
#define SOC_ETM_MCPWM2_EVT_CAP1_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_CAP1_ST_CLR_V << SOC_ETM_MCPWM2_EVT_CAP1_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_CAP1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_CAP1_ST_CLR_S  5
/** SOC_ETM_MCPWM2_EVT_CAP2_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_cap2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_CAP2_ST_CLR    (BIT(6))
#define SOC_ETM_MCPWM2_EVT_CAP2_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_CAP2_ST_CLR_V << SOC_ETM_MCPWM2_EVT_CAP2_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_CAP2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_CAP2_ST_CLR_S  6
/** SOC_ETM_MCPWM2_EVT_OP0_TEE1_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_op0_tee1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_OP0_TEE1_ST_CLR    (BIT(7))
#define SOC_ETM_MCPWM2_EVT_OP0_TEE1_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_OP0_TEE1_ST_CLR_V << SOC_ETM_MCPWM2_EVT_OP0_TEE1_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_OP0_TEE1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_OP0_TEE1_ST_CLR_S  7
/** SOC_ETM_MCPWM2_EVT_OP1_TEE1_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_op1_tee1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_OP1_TEE1_ST_CLR    (BIT(8))
#define SOC_ETM_MCPWM2_EVT_OP1_TEE1_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_OP1_TEE1_ST_CLR_V << SOC_ETM_MCPWM2_EVT_OP1_TEE1_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_OP1_TEE1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_OP1_TEE1_ST_CLR_S  8
/** SOC_ETM_MCPWM2_EVT_OP2_TEE1_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_op2_tee1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_OP2_TEE1_ST_CLR    (BIT(9))
#define SOC_ETM_MCPWM2_EVT_OP2_TEE1_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_OP2_TEE1_ST_CLR_V << SOC_ETM_MCPWM2_EVT_OP2_TEE1_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_OP2_TEE1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_OP2_TEE1_ST_CLR_S  9
/** SOC_ETM_MCPWM2_EVT_OP0_TEE2_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_op0_tee2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_OP0_TEE2_ST_CLR    (BIT(10))
#define SOC_ETM_MCPWM2_EVT_OP0_TEE2_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_OP0_TEE2_ST_CLR_V << SOC_ETM_MCPWM2_EVT_OP0_TEE2_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_OP0_TEE2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_OP0_TEE2_ST_CLR_S  10
/** SOC_ETM_MCPWM2_EVT_OP1_TEE2_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_op1_tee2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_OP1_TEE2_ST_CLR    (BIT(11))
#define SOC_ETM_MCPWM2_EVT_OP1_TEE2_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_OP1_TEE2_ST_CLR_V << SOC_ETM_MCPWM2_EVT_OP1_TEE2_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_OP1_TEE2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_OP1_TEE2_ST_CLR_S  11
/** SOC_ETM_MCPWM2_EVT_OP2_TEE2_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear MCPWM2_evt_op2_tee2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM2_EVT_OP2_TEE2_ST_CLR    (BIT(12))
#define SOC_ETM_MCPWM2_EVT_OP2_TEE2_ST_CLR_M  (SOC_ETM_MCPWM2_EVT_OP2_TEE2_ST_CLR_V << SOC_ETM_MCPWM2_EVT_OP2_TEE2_ST_CLR_S)
#define SOC_ETM_MCPWM2_EVT_OP2_TEE2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM2_EVT_OP2_TEE2_ST_CLR_S  12
/** SOC_ETM_MCPWM3_EVT_TIMER0_STOP_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer0_stop trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER0_STOP_ST_CLR    (BIT(13))
#define SOC_ETM_MCPWM3_EVT_TIMER0_STOP_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER0_STOP_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER0_STOP_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER0_STOP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER0_STOP_ST_CLR_S  13
/** SOC_ETM_MCPWM3_EVT_TIMER1_STOP_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer1_stop trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER1_STOP_ST_CLR    (BIT(14))
#define SOC_ETM_MCPWM3_EVT_TIMER1_STOP_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER1_STOP_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER1_STOP_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER1_STOP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER1_STOP_ST_CLR_S  14
/** SOC_ETM_MCPWM3_EVT_TIMER2_STOP_ST_CLR : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer2_stop trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER2_STOP_ST_CLR    (BIT(15))
#define SOC_ETM_MCPWM3_EVT_TIMER2_STOP_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER2_STOP_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER2_STOP_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER2_STOP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER2_STOP_ST_CLR_S  15
/** SOC_ETM_MCPWM3_EVT_TIMER0_TEZ_ST_CLR : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer0_tez trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEZ_ST_CLR    (BIT(16))
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEZ_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER0_TEZ_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER0_TEZ_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEZ_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEZ_ST_CLR_S  16
/** SOC_ETM_MCPWM3_EVT_TIMER1_TEZ_ST_CLR : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer1_tez trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEZ_ST_CLR    (BIT(17))
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEZ_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER1_TEZ_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER1_TEZ_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEZ_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEZ_ST_CLR_S  17
/** SOC_ETM_MCPWM3_EVT_TIMER2_TEZ_ST_CLR : WT; bitpos: [18]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer2_tez trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEZ_ST_CLR    (BIT(18))
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEZ_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER2_TEZ_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER2_TEZ_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEZ_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEZ_ST_CLR_S  18
/** SOC_ETM_MCPWM3_EVT_TIMER0_TEP_ST_CLR : WT; bitpos: [19]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer0_tep trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEP_ST_CLR    (BIT(19))
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEP_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER0_TEP_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER0_TEP_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEP_ST_CLR_S  19
/** SOC_ETM_MCPWM3_EVT_TIMER1_TEP_ST_CLR : WT; bitpos: [20]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer1_tep trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEP_ST_CLR    (BIT(20))
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEP_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER1_TEP_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER1_TEP_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEP_ST_CLR_S  20
/** SOC_ETM_MCPWM3_EVT_TIMER2_TEP_ST_CLR : WT; bitpos: [21]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer2_tep trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEP_ST_CLR    (BIT(21))
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEP_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER2_TEP_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER2_TEP_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEP_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEP_ST_CLR_S  21
/** SOC_ETM_MCPWM3_EVT_TIMER0_TEA_ST_CLR : WT; bitpos: [22]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer0_tea trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEA_ST_CLR    (BIT(22))
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEA_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER0_TEA_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER0_TEA_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEA_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEA_ST_CLR_S  22
/** SOC_ETM_MCPWM3_EVT_TIMER1_TEA_ST_CLR : WT; bitpos: [23]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer1_tea trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEA_ST_CLR    (BIT(23))
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEA_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER1_TEA_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER1_TEA_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEA_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEA_ST_CLR_S  23
/** SOC_ETM_MCPWM3_EVT_TIMER2_TEA_ST_CLR : WT; bitpos: [24]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer2_tea trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEA_ST_CLR    (BIT(24))
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEA_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER2_TEA_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER2_TEA_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEA_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEA_ST_CLR_S  24
/** SOC_ETM_MCPWM3_EVT_TIMER0_TEB_ST_CLR : WT; bitpos: [25]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer0_teb trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEB_ST_CLR    (BIT(25))
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEB_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER0_TEB_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER0_TEB_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEB_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER0_TEB_ST_CLR_S  25
/** SOC_ETM_MCPWM3_EVT_TIMER1_TEB_ST_CLR : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer1_teb trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEB_ST_CLR    (BIT(26))
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEB_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER1_TEB_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER1_TEB_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEB_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER1_TEB_ST_CLR_S  26
/** SOC_ETM_MCPWM3_EVT_TIMER2_TEB_ST_CLR : WT; bitpos: [27]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_timer2_teb trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEB_ST_CLR    (BIT(27))
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEB_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TIMER2_TEB_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TIMER2_TEB_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEB_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TIMER2_TEB_ST_CLR_S  27
/** SOC_ETM_MCPWM3_EVT_OP0_TEA_ST_CLR : WT; bitpos: [28]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op0_tea trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP0_TEA_ST_CLR    (BIT(28))
#define SOC_ETM_MCPWM3_EVT_OP0_TEA_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP0_TEA_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP0_TEA_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP0_TEA_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP0_TEA_ST_CLR_S  28
/** SOC_ETM_MCPWM3_EVT_OP1_TEA_ST_CLR : WT; bitpos: [29]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op1_tea trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP1_TEA_ST_CLR    (BIT(29))
#define SOC_ETM_MCPWM3_EVT_OP1_TEA_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP1_TEA_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP1_TEA_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP1_TEA_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP1_TEA_ST_CLR_S  29
/** SOC_ETM_MCPWM3_EVT_OP2_TEA_ST_CLR : WT; bitpos: [30]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op2_tea trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP2_TEA_ST_CLR    (BIT(30))
#define SOC_ETM_MCPWM3_EVT_OP2_TEA_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP2_TEA_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP2_TEA_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP2_TEA_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP2_TEA_ST_CLR_S  30
/** SOC_ETM_MCPWM3_EVT_OP0_TEB_ST_CLR : WT; bitpos: [31]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op0_teb trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP0_TEB_ST_CLR    (BIT(31))
#define SOC_ETM_MCPWM3_EVT_OP0_TEB_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP0_TEB_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP0_TEB_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP0_TEB_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP0_TEB_ST_CLR_S  31

