espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST7_CLR_REG register
 *  Events trigger status clear register
 */
#define SOC_ETM_EVT_ST7_CLR_REG (DR_REG_SOC_ETM_BASE + 0x1e4)
/** SOC_ETM_MCPWM3_EVT_OP1_TEB_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op1_teb trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP1_TEB_ST_CLR    (BIT(0))
#define SOC_ETM_MCPWM3_EVT_OP1_TEB_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP1_TEB_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP1_TEB_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP1_TEB_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP1_TEB_ST_CLR_S  0
/** SOC_ETM_MCPWM3_EVT_OP2_TEB_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op2_teb trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP2_TEB_ST_CLR    (BIT(1))
#define SOC_ETM_MCPWM3_EVT_OP2_TEB_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP2_TEB_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP2_TEB_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP2_TEB_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP2_TEB_ST_CLR_S  1
/** SOC_ETM_MCPWM3_EVT_F0_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_f0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_F0_ST_CLR    (BIT(2))
#define SOC_ETM_MCPWM3_EVT_F0_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_F0_ST_CLR_V << SOC_ETM_MCPWM3_EVT_F0_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_F0_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_F0_ST_CLR_S  2
/** SOC_ETM_MCPWM3_EVT_F1_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_f1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_F1_ST_CLR    (BIT(3))
#define SOC_ETM_MCPWM3_EVT_F1_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_F1_ST_CLR_V << SOC_ETM_MCPWM3_EVT_F1_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_F1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_F1_ST_CLR_S  3
/** SOC_ETM_MCPWM3_EVT_F2_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_f2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_F2_ST_CLR    (BIT(4))
#define SOC_ETM_MCPWM3_EVT_F2_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_F2_ST_CLR_V << SOC_ETM_MCPWM3_EVT_F2_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_F2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_F2_ST_CLR_S  4
/** SOC_ETM_MCPWM3_EVT_F0_CLR_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_f0_clr trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_F0_CLR_ST_CLR    (BIT(5))
#define SOC_ETM_MCPWM3_EVT_F0_CLR_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_F0_CLR_ST_CLR_V << SOC_ETM_MCPWM3_EVT_F0_CLR_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_F0_CLR_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_F0_CLR_ST_CLR_S  5
/** SOC_ETM_MCPWM3_EVT_F1_CLR_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_f1_clr trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_F1_CLR_ST_CLR    (BIT(6))
#define SOC_ETM_MCPWM3_EVT_F1_CLR_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_F1_CLR_ST_CLR_V << SOC_ETM_MCPWM3_EVT_F1_CLR_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_F1_CLR_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_F1_CLR_ST_CLR_S  6
/** SOC_ETM_MCPWM3_EVT_F2_CLR_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_f2_clr trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_F2_CLR_ST_CLR    (BIT(7))
#define SOC_ETM_MCPWM3_EVT_F2_CLR_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_F2_CLR_ST_CLR_V << SOC_ETM_MCPWM3_EVT_F2_CLR_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_F2_CLR_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_F2_CLR_ST_CLR_S  7
/** SOC_ETM_MCPWM3_EVT_TZ0_CBC_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_tz0_cbc trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TZ0_CBC_ST_CLR    (BIT(8))
#define SOC_ETM_MCPWM3_EVT_TZ0_CBC_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TZ0_CBC_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TZ0_CBC_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TZ0_CBC_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TZ0_CBC_ST_CLR_S  8
/** SOC_ETM_MCPWM3_EVT_TZ1_CBC_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_tz1_cbc trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TZ1_CBC_ST_CLR    (BIT(9))
#define SOC_ETM_MCPWM3_EVT_TZ1_CBC_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TZ1_CBC_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TZ1_CBC_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TZ1_CBC_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TZ1_CBC_ST_CLR_S  9
/** SOC_ETM_MCPWM3_EVT_TZ2_CBC_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_tz2_cbc trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TZ2_CBC_ST_CLR    (BIT(10))
#define SOC_ETM_MCPWM3_EVT_TZ2_CBC_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TZ2_CBC_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TZ2_CBC_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TZ2_CBC_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TZ2_CBC_ST_CLR_S  10
/** SOC_ETM_MCPWM3_EVT_TZ0_OST_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_tz0_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TZ0_OST_ST_CLR    (BIT(11))
#define SOC_ETM_MCPWM3_EVT_TZ0_OST_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TZ0_OST_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TZ0_OST_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TZ0_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TZ0_OST_ST_CLR_S  11
/** SOC_ETM_MCPWM3_EVT_TZ1_OST_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_tz1_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TZ1_OST_ST_CLR    (BIT(12))
#define SOC_ETM_MCPWM3_EVT_TZ1_OST_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TZ1_OST_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TZ1_OST_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TZ1_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TZ1_OST_ST_CLR_S  12
/** SOC_ETM_MCPWM3_EVT_TZ2_OST_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_tz2_ost trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_TZ2_OST_ST_CLR    (BIT(13))
#define SOC_ETM_MCPWM3_EVT_TZ2_OST_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_TZ2_OST_ST_CLR_V << SOC_ETM_MCPWM3_EVT_TZ2_OST_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_TZ2_OST_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_TZ2_OST_ST_CLR_S  13
/** SOC_ETM_MCPWM3_EVT_CAP0_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_cap0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_CAP0_ST_CLR    (BIT(14))
#define SOC_ETM_MCPWM3_EVT_CAP0_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_CAP0_ST_CLR_V << SOC_ETM_MCPWM3_EVT_CAP0_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_CAP0_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_CAP0_ST_CLR_S  14
/** SOC_ETM_MCPWM3_EVT_CAP1_ST_CLR : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_cap1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_CAP1_ST_CLR    (BIT(15))
#define SOC_ETM_MCPWM3_EVT_CAP1_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_CAP1_ST_CLR_V << SOC_ETM_MCPWM3_EVT_CAP1_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_CAP1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_CAP1_ST_CLR_S  15
/** SOC_ETM_MCPWM3_EVT_CAP2_ST_CLR : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_cap2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_CAP2_ST_CLR    (BIT(16))
#define SOC_ETM_MCPWM3_EVT_CAP2_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_CAP2_ST_CLR_V << SOC_ETM_MCPWM3_EVT_CAP2_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_CAP2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_CAP2_ST_CLR_S  16
/** SOC_ETM_MCPWM3_EVT_OP0_TEE1_ST_CLR : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op0_tee1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP0_TEE1_ST_CLR    (BIT(17))
#define SOC_ETM_MCPWM3_EVT_OP0_TEE1_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP0_TEE1_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP0_TEE1_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP0_TEE1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP0_TEE1_ST_CLR_S  17
/** SOC_ETM_MCPWM3_EVT_OP1_TEE1_ST_CLR : WT; bitpos: [18]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op1_tee1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP1_TEE1_ST_CLR    (BIT(18))
#define SOC_ETM_MCPWM3_EVT_OP1_TEE1_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP1_TEE1_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP1_TEE1_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP1_TEE1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP1_TEE1_ST_CLR_S  18
/** SOC_ETM_MCPWM3_EVT_OP2_TEE1_ST_CLR : WT; bitpos: [19]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op2_tee1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP2_TEE1_ST_CLR    (BIT(19))
#define SOC_ETM_MCPWM3_EVT_OP2_TEE1_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP2_TEE1_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP2_TEE1_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP2_TEE1_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP2_TEE1_ST_CLR_S  19
/** SOC_ETM_MCPWM3_EVT_OP0_TEE2_ST_CLR : WT; bitpos: [20]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op0_tee2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP0_TEE2_ST_CLR    (BIT(20))
#define SOC_ETM_MCPWM3_EVT_OP0_TEE2_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP0_TEE2_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP0_TEE2_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP0_TEE2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP0_TEE2_ST_CLR_S  20
/** SOC_ETM_MCPWM3_EVT_OP1_TEE2_ST_CLR : WT; bitpos: [21]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op1_tee2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP1_TEE2_ST_CLR    (BIT(21))
#define SOC_ETM_MCPWM3_EVT_OP1_TEE2_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP1_TEE2_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP1_TEE2_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP1_TEE2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP1_TEE2_ST_CLR_S  21
/** SOC_ETM_MCPWM3_EVT_OP2_TEE2_ST_CLR : WT; bitpos: [22]; default: 0;
 *  Configures whether or not to clear MCPWM3_evt_op2_tee2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MCPWM3_EVT_OP2_TEE2_ST_CLR    (BIT(22))
#define SOC_ETM_MCPWM3_EVT_OP2_TEE2_ST_CLR_M  (SOC_ETM_MCPWM3_EVT_OP2_TEE2_ST_CLR_V << SOC_ETM_MCPWM3_EVT_OP2_TEE2_ST_CLR_S)
#define SOC_ETM_MCPWM3_EVT_OP2_TEE2_ST_CLR_V  0x00000001U
#define SOC_ETM_MCPWM3_EVT_OP2_TEE2_ST_CLR_S  22
/** SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH0_ST_CLR : WT; bitpos: [23]; default: 0;
 *  Configures whether or not to clear ADC_evt_eq_above_thresh0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH0_ST_CLR    (BIT(23))
#define SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH0_ST_CLR_M  (SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH0_ST_CLR_V << SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH0_ST_CLR_S)
#define SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH0_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH0_ST_CLR_S  23
/** SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH1_ST_CLR : WT; bitpos: [24]; default: 0;
 *  Configures whether or not to clear ADC_evt_eq_above_thresh1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH1_ST_CLR    (BIT(24))
#define SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH1_ST_CLR_M  (SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH1_ST_CLR_V << SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH1_ST_CLR_S)
#define SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH1_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_EVT_EQ_ABOVE_THRESH1_ST_CLR_S  24
/** SOC_ETM_ADC_EVT_EQ_BELOW_THRESH0_ST_CLR : WT; bitpos: [25]; default: 0;
 *  Configures whether or not to clear ADC_evt_eq_below_thresh0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_EVT_EQ_BELOW_THRESH0_ST_CLR    (BIT(25))
#define SOC_ETM_ADC_EVT_EQ_BELOW_THRESH0_ST_CLR_M  (SOC_ETM_ADC_EVT_EQ_BELOW_THRESH0_ST_CLR_V << SOC_ETM_ADC_EVT_EQ_BELOW_THRESH0_ST_CLR_S)
#define SOC_ETM_ADC_EVT_EQ_BELOW_THRESH0_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_EVT_EQ_BELOW_THRESH0_ST_CLR_S  25
/** SOC_ETM_ADC_EVT_EQ_BELOW_THRESH1_ST_CLR : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to clear ADC_evt_eq_below_thresh1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_EVT_EQ_BELOW_THRESH1_ST_CLR    (BIT(26))
#define SOC_ETM_ADC_EVT_EQ_BELOW_THRESH1_ST_CLR_M  (SOC_ETM_ADC_EVT_EQ_BELOW_THRESH1_ST_CLR_V << SOC_ETM_ADC_EVT_EQ_BELOW_THRESH1_ST_CLR_S)
#define SOC_ETM_ADC_EVT_EQ_BELOW_THRESH1_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_EVT_EQ_BELOW_THRESH1_ST_CLR_S  26
/** SOC_ETM_ADC_EVT_ADC1_START_ST_CLR : WT; bitpos: [27]; default: 0;
 *  Configures whether or not to clear ADC_evt_adc1_start trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_EVT_ADC1_START_ST_CLR    (BIT(27))
#define SOC_ETM_ADC_EVT_ADC1_START_ST_CLR_M  (SOC_ETM_ADC_EVT_ADC1_START_ST_CLR_V << SOC_ETM_ADC_EVT_ADC1_START_ST_CLR_S)
#define SOC_ETM_ADC_EVT_ADC1_START_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_EVT_ADC1_START_ST_CLR_S  27
/** SOC_ETM_ADC_EVT_ADC2_START_ST_CLR : WT; bitpos: [28]; default: 0;
 *  Configures whether or not to clear ADC_evt_adc2_start trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_EVT_ADC2_START_ST_CLR    (BIT(28))
#define SOC_ETM_ADC_EVT_ADC2_START_ST_CLR_M  (SOC_ETM_ADC_EVT_ADC2_START_ST_CLR_V << SOC_ETM_ADC_EVT_ADC2_START_ST_CLR_S)
#define SOC_ETM_ADC_EVT_ADC2_START_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_EVT_ADC2_START_ST_CLR_S  28
/** SOC_ETM_ADC_EVT_ADC1_DONE_ST_CLR : WT; bitpos: [29]; default: 0;
 *  Configures whether or not to clear ADC_evt_adc1_done trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_EVT_ADC1_DONE_ST_CLR    (BIT(29))
#define SOC_ETM_ADC_EVT_ADC1_DONE_ST_CLR_M  (SOC_ETM_ADC_EVT_ADC1_DONE_ST_CLR_V << SOC_ETM_ADC_EVT_ADC1_DONE_ST_CLR_S)
#define SOC_ETM_ADC_EVT_ADC1_DONE_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_EVT_ADC1_DONE_ST_CLR_S  29
/** SOC_ETM_ADC_EVT_ADC2_DONE_ST_CLR : WT; bitpos: [30]; default: 0;
 *  Configures whether or not to clear ADC_evt_adc2_done trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ADC_EVT_ADC2_DONE_ST_CLR    (BIT(30))
#define SOC_ETM_ADC_EVT_ADC2_DONE_ST_CLR_M  (SOC_ETM_ADC_EVT_ADC2_DONE_ST_CLR_V << SOC_ETM_ADC_EVT_ADC2_DONE_ST_CLR_S)
#define SOC_ETM_ADC_EVT_ADC2_DONE_ST_CLR_V  0x00000001U
#define SOC_ETM_ADC_EVT_ADC2_DONE_ST_CLR_S  30
/** SOC_ETM_REGDMA_EVT_DONE0_ST_CLR : WT; bitpos: [31]; default: 0;
 *  Configures whether or not to clear REGDMA_evt_done0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_EVT_DONE0_ST_CLR    (BIT(31))
#define SOC_ETM_REGDMA_EVT_DONE0_ST_CLR_M  (SOC_ETM_REGDMA_EVT_DONE0_ST_CLR_V << SOC_ETM_REGDMA_EVT_DONE0_ST_CLR_S)
#define SOC_ETM_REGDMA_EVT_DONE0_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_DONE0_ST_CLR_S  31

