espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST8_CLR_REG register
 *  Events trigger status clear register
 */
#define SOC_ETM_EVT_ST8_CLR_REG (DR_REG_SOC_ETM_BASE + 0x1ec)
/** SOC_ETM_REGDMA_EVT_DONE1_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear REGDMA_evt_done1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_EVT_DONE1_ST_CLR    (BIT(0))
#define SOC_ETM_REGDMA_EVT_DONE1_ST_CLR_M  (SOC_ETM_REGDMA_EVT_DONE1_ST_CLR_V << SOC_ETM_REGDMA_EVT_DONE1_ST_CLR_S)
#define SOC_ETM_REGDMA_EVT_DONE1_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_DONE1_ST_CLR_S  0
/** SOC_ETM_REGDMA_EVT_DONE2_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear REGDMA_evt_done2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_EVT_DONE2_ST_CLR    (BIT(1))
#define SOC_ETM_REGDMA_EVT_DONE2_ST_CLR_M  (SOC_ETM_REGDMA_EVT_DONE2_ST_CLR_V << SOC_ETM_REGDMA_EVT_DONE2_ST_CLR_S)
#define SOC_ETM_REGDMA_EVT_DONE2_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_DONE2_ST_CLR_S  1
/** SOC_ETM_REGDMA_EVT_DONE3_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear REGDMA_evt_done3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_EVT_DONE3_ST_CLR    (BIT(2))
#define SOC_ETM_REGDMA_EVT_DONE3_ST_CLR_M  (SOC_ETM_REGDMA_EVT_DONE3_ST_CLR_V << SOC_ETM_REGDMA_EVT_DONE3_ST_CLR_S)
#define SOC_ETM_REGDMA_EVT_DONE3_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_DONE3_ST_CLR_S  2
/** SOC_ETM_REGDMA_EVT_FAIL0_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear REGDMA_evt_fail0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_EVT_FAIL0_ST_CLR    (BIT(3))
#define SOC_ETM_REGDMA_EVT_FAIL0_ST_CLR_M  (SOC_ETM_REGDMA_EVT_FAIL0_ST_CLR_V << SOC_ETM_REGDMA_EVT_FAIL0_ST_CLR_S)
#define SOC_ETM_REGDMA_EVT_FAIL0_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_FAIL0_ST_CLR_S  3
/** SOC_ETM_REGDMA_EVT_FAIL1_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear REGDMA_evt_fail1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_EVT_FAIL1_ST_CLR    (BIT(4))
#define SOC_ETM_REGDMA_EVT_FAIL1_ST_CLR_M  (SOC_ETM_REGDMA_EVT_FAIL1_ST_CLR_V << SOC_ETM_REGDMA_EVT_FAIL1_ST_CLR_S)
#define SOC_ETM_REGDMA_EVT_FAIL1_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_FAIL1_ST_CLR_S  4
/** SOC_ETM_REGDMA_EVT_FAIL2_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear REGDMA_evt_fail2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_EVT_FAIL2_ST_CLR    (BIT(5))
#define SOC_ETM_REGDMA_EVT_FAIL2_ST_CLR_M  (SOC_ETM_REGDMA_EVT_FAIL2_ST_CLR_V << SOC_ETM_REGDMA_EVT_FAIL2_ST_CLR_S)
#define SOC_ETM_REGDMA_EVT_FAIL2_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_FAIL2_ST_CLR_S  5
/** SOC_ETM_REGDMA_EVT_FAIL3_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear REGDMA_evt_fail3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_REGDMA_EVT_FAIL3_ST_CLR    (BIT(6))
#define SOC_ETM_REGDMA_EVT_FAIL3_ST_CLR_M  (SOC_ETM_REGDMA_EVT_FAIL3_ST_CLR_V << SOC_ETM_REGDMA_EVT_FAIL3_ST_CLR_S)
#define SOC_ETM_REGDMA_EVT_FAIL3_ST_CLR_V  0x00000001U
#define SOC_ETM_REGDMA_EVT_FAIL3_ST_CLR_S  6
/** SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear TMPSNSR_evt_over_limit trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_CLR    (BIT(7))
#define SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_CLR_M  (SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_CLR_V << SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_CLR_S)
#define SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_CLR_V  0x00000001U
#define SOC_ETM_TMPSNSR_EVT_OVER_LIMIT_ST_CLR_S  7
/** SOC_ETM_I2S0_EVT_RX_DONE_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear I2S0_evt_rx_done trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_EVT_RX_DONE_ST_CLR    (BIT(8))
#define SOC_ETM_I2S0_EVT_RX_DONE_ST_CLR_M  (SOC_ETM_I2S0_EVT_RX_DONE_ST_CLR_V << SOC_ETM_I2S0_EVT_RX_DONE_ST_CLR_S)
#define SOC_ETM_I2S0_EVT_RX_DONE_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_EVT_RX_DONE_ST_CLR_S  8
/** SOC_ETM_I2S0_EVT_TX_DONE_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear I2S0_evt_tx_done trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_EVT_TX_DONE_ST_CLR    (BIT(9))
#define SOC_ETM_I2S0_EVT_TX_DONE_ST_CLR_M  (SOC_ETM_I2S0_EVT_TX_DONE_ST_CLR_V << SOC_ETM_I2S0_EVT_TX_DONE_ST_CLR_S)
#define SOC_ETM_I2S0_EVT_TX_DONE_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_EVT_TX_DONE_ST_CLR_S  9
/** SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear I2S0_evt_x_words_received trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_CLR    (BIT(10))
#define SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_CLR_M  (SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_CLR_V << SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_CLR_S)
#define SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_EVT_X_WORDS_RECEIVED_ST_CLR_S  10
/** SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear I2S0_evt_x_words_sent trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_CLR    (BIT(11))
#define SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_CLR_M  (SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_CLR_V << SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_CLR_S)
#define SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S0_EVT_X_WORDS_SENT_ST_CLR_S  11
/** SOC_ETM_I2S1_EVT_RX_DONE_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear I2S1_evt_rx_done trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S1_EVT_RX_DONE_ST_CLR    (BIT(12))
#define SOC_ETM_I2S1_EVT_RX_DONE_ST_CLR_M  (SOC_ETM_I2S1_EVT_RX_DONE_ST_CLR_V << SOC_ETM_I2S1_EVT_RX_DONE_ST_CLR_S)
#define SOC_ETM_I2S1_EVT_RX_DONE_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S1_EVT_RX_DONE_ST_CLR_S  12
/** SOC_ETM_I2S1_EVT_TX_DONE_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear I2S1_evt_tx_done trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S1_EVT_TX_DONE_ST_CLR    (BIT(13))
#define SOC_ETM_I2S1_EVT_TX_DONE_ST_CLR_M  (SOC_ETM_I2S1_EVT_TX_DONE_ST_CLR_V << SOC_ETM_I2S1_EVT_TX_DONE_ST_CLR_S)
#define SOC_ETM_I2S1_EVT_TX_DONE_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S1_EVT_TX_DONE_ST_CLR_S  13
/** SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear I2S1_evt_x_words_received trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_CLR    (BIT(14))
#define SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_CLR_M  (SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_CLR_V << SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_CLR_S)
#define SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S1_EVT_X_WORDS_RECEIVED_ST_CLR_S  14
/** SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_CLR : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear I2S1_evt_x_words_sent trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_CLR    (BIT(15))
#define SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_CLR_M  (SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_CLR_V << SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_CLR_S)
#define SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_CLR_V  0x00000001U
#define SOC_ETM_I2S1_EVT_X_WORDS_SENT_ST_CLR_S  15
/** SOC_ETM_ULP_EVT_ERR_INTR_ST_CLR : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear ULP_evt_err_intr trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ULP_EVT_ERR_INTR_ST_CLR    (BIT(16))
#define SOC_ETM_ULP_EVT_ERR_INTR_ST_CLR_M  (SOC_ETM_ULP_EVT_ERR_INTR_ST_CLR_V << SOC_ETM_ULP_EVT_ERR_INTR_ST_CLR_S)
#define SOC_ETM_ULP_EVT_ERR_INTR_ST_CLR_V  0x00000001U
#define SOC_ETM_ULP_EVT_ERR_INTR_ST_CLR_S  16
/** SOC_ETM_ULP_EVT_HALT_ST_CLR : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear ULP_evt_halt trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ULP_EVT_HALT_ST_CLR    (BIT(17))
#define SOC_ETM_ULP_EVT_HALT_ST_CLR_M  (SOC_ETM_ULP_EVT_HALT_ST_CLR_V << SOC_ETM_ULP_EVT_HALT_ST_CLR_S)
#define SOC_ETM_ULP_EVT_HALT_ST_CLR_V  0x00000001U
#define SOC_ETM_ULP_EVT_HALT_ST_CLR_S  17
/** SOC_ETM_ULP_EVT_START_INTR_ST_CLR : WT; bitpos: [18]; default: 0;
 *  Configures whether or not to clear ULP_evt_start_intr trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ULP_EVT_START_INTR_ST_CLR    (BIT(18))
#define SOC_ETM_ULP_EVT_START_INTR_ST_CLR_M  (SOC_ETM_ULP_EVT_START_INTR_ST_CLR_V << SOC_ETM_ULP_EVT_START_INTR_ST_CLR_S)
#define SOC_ETM_ULP_EVT_START_INTR_ST_CLR_V  0x00000001U
#define SOC_ETM_ULP_EVT_START_INTR_ST_CLR_S  18
/** SOC_ETM_RTC_EVT_TICK_ST_CLR : WT; bitpos: [19]; default: 0;
 *  Configures whether or not to clear RTC_evt_tick trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_EVT_TICK_ST_CLR    (BIT(19))
#define SOC_ETM_RTC_EVT_TICK_ST_CLR_M  (SOC_ETM_RTC_EVT_TICK_ST_CLR_V << SOC_ETM_RTC_EVT_TICK_ST_CLR_S)
#define SOC_ETM_RTC_EVT_TICK_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_EVT_TICK_ST_CLR_S  19
/** SOC_ETM_RTC_EVT_OVF_ST_CLR : WT; bitpos: [20]; default: 0;
 *  Configures whether or not to clear RTC_evt_ovf trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_EVT_OVF_ST_CLR    (BIT(20))
#define SOC_ETM_RTC_EVT_OVF_ST_CLR_M  (SOC_ETM_RTC_EVT_OVF_ST_CLR_V << SOC_ETM_RTC_EVT_OVF_ST_CLR_S)
#define SOC_ETM_RTC_EVT_OVF_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_EVT_OVF_ST_CLR_S  20
/** SOC_ETM_RTC_EVT_CMP_ST_CLR : WT; bitpos: [21]; default: 0;
 *  Configures whether or not to clear RTC_evt_cmp trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_RTC_EVT_CMP_ST_CLR    (BIT(21))
#define SOC_ETM_RTC_EVT_CMP_ST_CLR_M  (SOC_ETM_RTC_EVT_CMP_ST_CLR_V << SOC_ETM_RTC_EVT_CMP_ST_CLR_S)
#define SOC_ETM_RTC_EVT_CMP_ST_CLR_V  0x00000001U
#define SOC_ETM_RTC_EVT_CMP_ST_CLR_S  21
/** SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR : WT; bitpos: [22]; default: 0;
 *  Configures whether or not to clear PMU_evt_sleep_weekup trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR    (BIT(22))
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_M  (SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_V << SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_S)
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_V  0x00000001U
#define SOC_ETM_PMU_EVT_SLEEP_WEEKUP_ST_CLR_S  22
/** SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH0_ST_CLR : WT; bitpos: [23]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_in_done_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH0_ST_CLR    (BIT(23))
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH0_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH0_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH0_ST_CLR_S  23
/** SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH1_ST_CLR : WT; bitpos: [24]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_in_done_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH1_ST_CLR    (BIT(24))
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH1_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH1_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH1_ST_CLR_S  24
/** SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH2_ST_CLR : WT; bitpos: [25]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_in_done_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH2_ST_CLR    (BIT(25))
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH2_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH2_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH2_ST_CLR_S  25
/** SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH3_ST_CLR : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_in_done_ch3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH3_ST_CLR    (BIT(26))
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH3_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH3_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH3_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH3_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH3_ST_CLR_S  26
/** SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH4_ST_CLR : WT; bitpos: [27]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_in_done_ch4 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH4_ST_CLR    (BIT(27))
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH4_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH4_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH4_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH4_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_IN_DONE_CH4_ST_CLR_S  27
/** SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_CLR : WT; bitpos: [28]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_in_suc_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_CLR    (BIT(28))
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH0_ST_CLR_S  28
/** SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_CLR : WT; bitpos: [29]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_in_suc_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_CLR    (BIT(29))
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH1_ST_CLR_S  29
/** SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_CLR : WT; bitpos: [30]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_in_suc_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_CLR    (BIT(30))
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH2_ST_CLR_S  30
/** SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH3_ST_CLR : WT; bitpos: [31]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_evt_in_suc_eof_ch3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH3_ST_CLR    (BIT(31))
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH3_ST_CLR_M  (SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH3_ST_CLR_V << SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH3_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH3_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_EVT_IN_SUC_EOF_CH3_ST_CLR_S  31

