espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_reg.h
/** SOC_ETM_EVT_ST11_CLR_REG register
 *  Events trigger status clear register
 */
#define SOC_ETM_EVT_ST11_CLR_REG (DR_REG_SOC_ETM_BASE + 0x204)
/** SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_fifo_full_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR    (BIT(0))
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH1_ST_CLR_S  0
/** SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_in_fifo_full_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR    (BIT(1))
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_IN_FIFO_FULL_CH2_ST_CLR_S  1
/** SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_done_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR    (BIT(2))
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH0_ST_CLR_S  2
/** SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_done_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR    (BIT(3))
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH1_ST_CLR_S  3
/** SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_done_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR    (BIT(4))
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_DONE_CH2_ST_CLR_S  4
/** SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR    (BIT(5))
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH0_ST_CLR_S  5
/** SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR    (BIT(6))
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH1_ST_CLR_S  6
/** SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR    (BIT(7))
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_EOF_CH2_ST_CLR_S  7
/** SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_total_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR    (BIT(8))
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_S  8
/** SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_total_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR    (BIT(9))
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH1_ST_CLR_S  9
/** SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_total_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR    (BIT(10))
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_TOTAL_EOF_CH2_ST_CLR_S  10
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_empty_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR    (BIT(11))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH0_ST_CLR_S  11
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_empty_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR    (BIT(12))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH1_ST_CLR_S  12
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_empty_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR    (BIT(13))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_EMPTY_CH2_ST_CLR_S  13
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_full_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR    (BIT(14))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH0_ST_CLR_S  14
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_full_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR    (BIT(15))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH1_ST_CLR_S  15
/** SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_evt_out_fifo_full_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR    (BIT(16))
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_EVT_OUT_FIFO_FULL_CH2_ST_CLR_S  16
/** SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_done_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR    (BIT(17))
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH0_ST_CLR_S  17
/** SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR : WT; bitpos: [18]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_done_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR    (BIT(18))
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH1_ST_CLR_S  18
/** SOC_ETM_DMA2D_EVT_IN_DONE_CH2_ST_CLR : WT; bitpos: [19]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_done_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH2_ST_CLR    (BIT(19))
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH2_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_DONE_CH2_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_DONE_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_DONE_CH2_ST_CLR_S  19
/** SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR : WT; bitpos: [20]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_suc_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR    (BIT(20))
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH0_ST_CLR_S  20
/** SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR : WT; bitpos: [21]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_suc_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR    (BIT(21))
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH1_ST_CLR_S  21
/** SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH2_ST_CLR : WT; bitpos: [22]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_in_suc_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH2_ST_CLR    (BIT(22))
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH2_ST_CLR_M  (SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH2_ST_CLR_V << SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_IN_SUC_EOF_CH2_ST_CLR_S  22
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR : WT; bitpos: [23]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_done_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR    (BIT(23))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH0_ST_CLR_S  23
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR : WT; bitpos: [24]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_done_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR    (BIT(24))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH1_ST_CLR_S  24
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR : WT; bitpos: [25]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_done_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR    (BIT(25))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH2_ST_CLR_S  25
/** SOC_ETM_DMA2D_EVT_OUT_DONE_CH3_ST_CLR : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_done_ch3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH3_ST_CLR    (BIT(26))
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH3_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_DONE_CH3_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_DONE_CH3_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH3_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_DONE_CH3_ST_CLR_S  26
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR : WT; bitpos: [27]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR    (BIT(27))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH0_ST_CLR_S  27
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR : WT; bitpos: [28]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_eof_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR    (BIT(28))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH1_ST_CLR_S  28
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR : WT; bitpos: [29]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_eof_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR    (BIT(29))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH2_ST_CLR_S  29
/** SOC_ETM_DMA2D_EVT_OUT_EOF_CH3_ST_CLR : WT; bitpos: [30]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_eof_ch3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH3_ST_CLR    (BIT(30))
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH3_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_EOF_CH3_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_EOF_CH3_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH3_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_EOF_CH3_ST_CLR_S  30
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR : WT; bitpos: [31]; default: 0;
 *  Configures whether or not to clear DMA2D_evt_out_total_eof_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR    (BIT(31))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH0_ST_CLR_S  31

/** SOC_ETM_EVT_ST12_REG register
 *  Events trigger status register
 */
#define SOC_ETM_EVT_ST12_REG (DR_REG_SOC_ETM_BASE + 0x208)
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents DMA2D_evt_out_total_eof_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST    (BIT(0))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH1_ST_S  0
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents DMA2D_evt_out_total_eof_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST    (BIT(1))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH2_ST_S  1
/** SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH3_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents DMA2D_evt_out_total_eof_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH3_ST    (BIT(2))
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH3_ST_M  (SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH3_ST_V << SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH3_ST_S)
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH3_ST_V  0x00000001U
#define SOC_ETM_DMA2D_EVT_OUT_TOTAL_EOF_CH3_ST_S  2
/** SOC_ETM_MODEM_EVT_G0_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents MODEM_evt_g0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_EVT_G0_ST    (BIT(3))
#define SOC_ETM_MODEM_EVT_G0_ST_M  (SOC_ETM_MODEM_EVT_G0_ST_V << SOC_ETM_MODEM_EVT_G0_ST_S)
#define SOC_ETM_MODEM_EVT_G0_ST_V  0x00000001U
#define SOC_ETM_MODEM_EVT_G0_ST_S  3
/** SOC_ETM_MODEM_EVT_G1_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents MODEM_evt_g1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_EVT_G1_ST    (BIT(4))
#define SOC_ETM_MODEM_EVT_G1_ST_M  (SOC_ETM_MODEM_EVT_G1_ST_V << SOC_ETM_MODEM_EVT_G1_ST_S)
#define SOC_ETM_MODEM_EVT_G1_ST_V  0x00000001U
#define SOC_ETM_MODEM_EVT_G1_ST_S  4
/** SOC_ETM_MODEM_EVT_G2_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents MODEM_evt_g2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_EVT_G2_ST    (BIT(5))
#define SOC_ETM_MODEM_EVT_G2_ST_M  (SOC_ETM_MODEM_EVT_G2_ST_V << SOC_ETM_MODEM_EVT_G2_ST_S)
#define SOC_ETM_MODEM_EVT_G2_ST_V  0x00000001U
#define SOC_ETM_MODEM_EVT_G2_ST_S  5
/** SOC_ETM_MODEM_EVT_G3_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents MODEM_evt_g3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_EVT_G3_ST    (BIT(6))
#define SOC_ETM_MODEM_EVT_G3_ST_M  (SOC_ETM_MODEM_EVT_G3_ST_V << SOC_ETM_MODEM_EVT_G3_ST_S)
#define SOC_ETM_MODEM_EVT_G3_ST_V  0x00000001U
#define SOC_ETM_MODEM_EVT_G3_ST_S  6
/** SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_POS_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents ZERO_DET_evt_delay_channel_1_pos trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_POS_ST    (BIT(7))
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_POS_ST_M  (SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_POS_ST_V << SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_POS_ST_S)
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_POS_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_POS_ST_S  7
/** SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_POS_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents ZERO_DET_evt_delay_channel_2_pos trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_POS_ST    (BIT(8))
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_POS_ST_M  (SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_POS_ST_V << SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_POS_ST_S)
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_POS_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_POS_ST_S  8
/** SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_POS_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents ZERO_DET_evt_delay_channel_3_pos trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_POS_ST    (BIT(9))
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_POS_ST_M  (SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_POS_ST_V << SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_POS_ST_S)
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_POS_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_POS_ST_S  9
/** SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_NEG_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents ZERO_DET_evt_delay_channel_1_neg trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_NEG_ST    (BIT(10))
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_NEG_ST_M  (SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_NEG_ST_V << SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_NEG_ST_S)
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_NEG_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_1_NEG_ST_S  10
/** SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_NEG_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents ZERO_DET_evt_delay_channel_2_neg trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_NEG_ST    (BIT(11))
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_NEG_ST_M  (SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_NEG_ST_V << SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_NEG_ST_S)
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_NEG_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_2_NEG_ST_S  11
/** SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_NEG_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents ZERO_DET_evt_delay_channel_3_neg trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_NEG_ST    (BIT(12))
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_NEG_ST_M  (SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_NEG_ST_V << SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_NEG_ST_S)
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_NEG_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_EVT_DELAY_CHANNEL_3_NEG_ST_S  12
/** SOC_ETM_CORDIC_EVT_RES_RDY_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents CORDIC_evt_res_rdy trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_CORDIC_EVT_RES_RDY_ST    (BIT(13))
#define SOC_ETM_CORDIC_EVT_RES_RDY_ST_M  (SOC_ETM_CORDIC_EVT_RES_RDY_ST_V << SOC_ETM_CORDIC_EVT_RES_RDY_ST_S)
#define SOC_ETM_CORDIC_EVT_RES_RDY_ST_V  0x00000001U
#define SOC_ETM_CORDIC_EVT_RES_RDY_ST_S  13

