espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_reg.h
/** SOC_ETM_TASK_ST10_REG register
 *  Tasks trigger status register
 */
#define SOC_ETM_TASK_ST10_REG (DR_REG_SOC_ETM_BASE + 0x260)
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents PDMA_AHB_task_out_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST    (BIT(0))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_S  0
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents PDMA_AHB_task_out_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST    (BIT(1))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_S  1
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents PDMA_AHB_task_out_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST    (BIT(2))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_S  2
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents PDMA_AHB_task_out_start_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST    (BIT(3))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_S  3
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents PDMA_AHB_task_out_start_ch4 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST    (BIT(4))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_S  4
/** SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST : R/WTC/SS; bitpos: [5]; default: 0;
 *  Represents LP_PDMA_AHB_task_in_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST    (BIT(5))
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_M  (SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_V << SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_S)
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_V  0x00000001U
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_S  5
/** SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST : R/WTC/SS; bitpos: [6]; default: 0;
 *  Represents LP_PDMA_AHB_task_in_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST    (BIT(6))
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_M  (SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_V << SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_S)
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_V  0x00000001U
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_S  6
/** SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST : R/WTC/SS; bitpos: [7]; default: 0;
 *  Represents LP_PDMA_AHB_task_out_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST    (BIT(7))
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_M  (SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_V << SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_S)
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_V  0x00000001U
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_S  7
/** SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST : R/WTC/SS; bitpos: [8]; default: 0;
 *  Represents LP_PDMA_AHB_task_out_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST    (BIT(8))
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_M  (SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_V << SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_S)
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_V  0x00000001U
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_S  8
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST : R/WTC/SS; bitpos: [9]; default: 0;
 *  Represents PDMA_AXI_task_in_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST    (BIT(9))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_S  9
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST : R/WTC/SS; bitpos: [10]; default: 0;
 *  Represents PDMA_AXI_task_in_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST    (BIT(10))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_S  10
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST : R/WTC/SS; bitpos: [11]; default: 0;
 *  Represents PDMA_AXI_task_in_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST    (BIT(11))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_S  11
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST : R/WTC/SS; bitpos: [12]; default: 0;
 *  Represents PDMA_AXI_task_out_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST    (BIT(12))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_S  12
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST : R/WTC/SS; bitpos: [13]; default: 0;
 *  Represents PDMA_AXI_task_out_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST    (BIT(13))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_S  13
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST : R/WTC/SS; bitpos: [14]; default: 0;
 *  Represents PDMA_AXI_task_out_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST    (BIT(14))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_S  14
/** SOC_ETM_DMA2D_TASK_IN_START_CH0_ST : R/WTC/SS; bitpos: [15]; default: 0;
 *  Represents DMA2D_task_in_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST    (BIT(15))
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_M  (SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_V << SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_S  15
/** SOC_ETM_DMA2D_TASK_IN_START_CH1_ST : R/WTC/SS; bitpos: [16]; default: 0;
 *  Represents DMA2D_task_in_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST    (BIT(16))
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_M  (SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_V << SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_S  16
/** SOC_ETM_DMA2D_TASK_IN_START_CH2_ST : R/WTC/SS; bitpos: [17]; default: 0;
 *  Represents DMA2D_task_in_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH2_ST    (BIT(17))
#define SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_M  (SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_V << SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_S  17
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST : R/WTC/SS; bitpos: [18]; default: 0;
 *  Represents DMA2D_task_in_dscr_ready_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST    (BIT(18))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_S  18
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST : R/WTC/SS; bitpos: [19]; default: 0;
 *  Represents DMA2D_task_in_dscr_ready_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST    (BIT(19))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_S  19
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST : R/WTC/SS; bitpos: [20]; default: 0;
 *  Represents DMA2D_task_in_dscr_ready_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST    (BIT(20))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_S  20
/** SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST : R/WTC/SS; bitpos: [21]; default: 0;
 *  Represents DMA2D_task_out_start_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST    (BIT(21))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_V << SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_S  21
/** SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST : R/WTC/SS; bitpos: [22]; default: 0;
 *  Represents DMA2D_task_out_start_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST    (BIT(22))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_V << SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_S  22
/** SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST : R/WTC/SS; bitpos: [23]; default: 0;
 *  Represents DMA2D_task_out_start_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST    (BIT(23))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_V << SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_S  23
/** SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST : R/WTC/SS; bitpos: [24]; default: 0;
 *  Represents DMA2D_task_out_start_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST    (BIT(24))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_V << SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_S  24
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST : R/WTC/SS; bitpos: [25]; default: 0;
 *  Represents DMA2D_task_out_dscr_ready_ch0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST    (BIT(25))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_S  25
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST : R/WTC/SS; bitpos: [26]; default: 0;
 *  Represents DMA2D_task_out_dscr_ready_ch1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST    (BIT(26))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_S  26
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST : R/WTC/SS; bitpos: [27]; default: 0;
 *  Represents DMA2D_task_out_dscr_ready_ch2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST    (BIT(27))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_S  27
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST : R/WTC/SS; bitpos: [28]; default: 0;
 *  Represents DMA2D_task_out_dscr_ready_ch3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST    (BIT(28))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_S  28
/** SOC_ETM_MODEM_TASK_G0_ST : R/WTC/SS; bitpos: [29]; default: 0;
 *  Represents MODEM_task_g0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_TASK_G0_ST    (BIT(29))
#define SOC_ETM_MODEM_TASK_G0_ST_M  (SOC_ETM_MODEM_TASK_G0_ST_V << SOC_ETM_MODEM_TASK_G0_ST_S)
#define SOC_ETM_MODEM_TASK_G0_ST_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G0_ST_S  29
/** SOC_ETM_MODEM_TASK_G1_ST : R/WTC/SS; bitpos: [30]; default: 0;
 *  Represents MODEM_task_g1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_TASK_G1_ST    (BIT(30))
#define SOC_ETM_MODEM_TASK_G1_ST_M  (SOC_ETM_MODEM_TASK_G1_ST_V << SOC_ETM_MODEM_TASK_G1_ST_S)
#define SOC_ETM_MODEM_TASK_G1_ST_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G1_ST_S  30
/** SOC_ETM_MODEM_TASK_G2_ST : R/WTC/SS; bitpos: [31]; default: 0;
 *  Represents MODEM_task_g2 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_TASK_G2_ST    (BIT(31))
#define SOC_ETM_MODEM_TASK_G2_ST_M  (SOC_ETM_MODEM_TASK_G2_ST_V << SOC_ETM_MODEM_TASK_G2_ST_S)
#define SOC_ETM_MODEM_TASK_G2_ST_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G2_ST_S  31

