espressif/esp-idf/components/soc/esp32s31/register/soc/soc_etm_reg.h
/** SOC_ETM_TASK_ST10_CLR_REG register
 *  Tasks trigger status clear register
 */
#define SOC_ETM_TASK_ST10_CLR_REG (DR_REG_SOC_ETM_BASE + 0x264)
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_out_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR    (BIT(0))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_S  0
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_out_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR    (BIT(1))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_S  1
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_out_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR    (BIT(2))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH2_ST_CLR_S  2
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_out_start_ch3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_CLR    (BIT(3))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH3_ST_CLR_S  3
/** SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear PDMA_AHB_task_out_start_ch4 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_CLR    (BIT(4))
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_CLR_M  (SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_CLR_V << SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_CLR_S)
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AHB_TASK_OUT_START_CH4_ST_CLR_S  4
/** SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_CLR : WT; bitpos: [5]; default: 0;
 *  Configures whether or not to clear LP_PDMA_AHB_task_in_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_CLR    (BIT(5))
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_M  (SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_V << SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_S)
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH0_ST_CLR_S  5
/** SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_CLR : WT; bitpos: [6]; default: 0;
 *  Configures whether or not to clear LP_PDMA_AHB_task_in_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_CLR    (BIT(6))
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_M  (SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_V << SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_S)
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_LP_PDMA_AHB_TASK_IN_START_CH1_ST_CLR_S  6
/** SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR : WT; bitpos: [7]; default: 0;
 *  Configures whether or not to clear LP_PDMA_AHB_task_out_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR    (BIT(7))
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_M  (SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_V << SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_S)
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH0_ST_CLR_S  7
/** SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR : WT; bitpos: [8]; default: 0;
 *  Configures whether or not to clear LP_PDMA_AHB_task_out_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR    (BIT(8))
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_M  (SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_V << SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_S)
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_LP_PDMA_AHB_TASK_OUT_START_CH1_ST_CLR_S  8
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR : WT; bitpos: [9]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_in_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR    (BIT(9))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH0_ST_CLR_S  9
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR : WT; bitpos: [10]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_in_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR    (BIT(10))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH1_ST_CLR_S  10
/** SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR : WT; bitpos: [11]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_in_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR    (BIT(11))
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_IN_START_CH2_ST_CLR_S  11
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR : WT; bitpos: [12]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_out_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR    (BIT(12))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH0_ST_CLR_S  12
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR : WT; bitpos: [13]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_out_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR    (BIT(13))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH1_ST_CLR_S  13
/** SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR : WT; bitpos: [14]; default: 0;
 *  Configures whether or not to clear PDMA_AXI_task_out_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR    (BIT(14))
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_M  (SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_V << SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_S)
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_PDMA_AXI_TASK_OUT_START_CH2_ST_CLR_S  14
/** SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR : WT; bitpos: [15]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR    (BIT(15))
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH0_ST_CLR_S  15
/** SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR : WT; bitpos: [16]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR    (BIT(16))
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH1_ST_CLR_S  16
/** SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_CLR : WT; bitpos: [17]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_CLR    (BIT(17))
#define SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_START_CH2_ST_CLR_S  17
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR : WT; bitpos: [18]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_dscr_ready_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR    (BIT(18))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH0_ST_CLR_S  18
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR : WT; bitpos: [19]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_dscr_ready_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR    (BIT(19))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH1_ST_CLR_S  19
/** SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_CLR : WT; bitpos: [20]; default: 0;
 *  Configures whether or not to clear DMA2D_task_in_dscr_ready_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_CLR    (BIT(20))
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_CLR_M  (SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_CLR_V << SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_IN_DSCR_READY_CH2_ST_CLR_S  20
/** SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR : WT; bitpos: [21]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_start_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR    (BIT(21))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH0_ST_CLR_S  21
/** SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR : WT; bitpos: [22]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_start_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR    (BIT(22))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH1_ST_CLR_S  22
/** SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR : WT; bitpos: [23]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_start_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR    (BIT(23))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH2_ST_CLR_S  23
/** SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_CLR : WT; bitpos: [24]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_start_ch3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_CLR    (BIT(24))
#define SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_START_CH3_ST_CLR_S  24
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR : WT; bitpos: [25]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR    (BIT(25))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH0_ST_CLR_S  25
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR : WT; bitpos: [26]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR    (BIT(26))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH1_ST_CLR_S  26
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR : WT; bitpos: [27]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR    (BIT(27))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH2_ST_CLR_S  27
/** SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_CLR : WT; bitpos: [28]; default: 0;
 *  Configures whether or not to clear DMA2D_task_out_dscr_ready_ch3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_CLR    (BIT(28))
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_CLR_M  (SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_CLR_V << SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_CLR_S)
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_CLR_V  0x00000001U
#define SOC_ETM_DMA2D_TASK_OUT_DSCR_READY_CH3_ST_CLR_S  28
/** SOC_ETM_MODEM_TASK_G0_ST_CLR : WT; bitpos: [29]; default: 0;
 *  Configures whether or not to clear MODEM_task_g0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MODEM_TASK_G0_ST_CLR    (BIT(29))
#define SOC_ETM_MODEM_TASK_G0_ST_CLR_M  (SOC_ETM_MODEM_TASK_G0_ST_CLR_V << SOC_ETM_MODEM_TASK_G0_ST_CLR_S)
#define SOC_ETM_MODEM_TASK_G0_ST_CLR_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G0_ST_CLR_S  29
/** SOC_ETM_MODEM_TASK_G1_ST_CLR : WT; bitpos: [30]; default: 0;
 *  Configures whether or not to clear MODEM_task_g1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MODEM_TASK_G1_ST_CLR    (BIT(30))
#define SOC_ETM_MODEM_TASK_G1_ST_CLR_M  (SOC_ETM_MODEM_TASK_G1_ST_CLR_V << SOC_ETM_MODEM_TASK_G1_ST_CLR_S)
#define SOC_ETM_MODEM_TASK_G1_ST_CLR_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G1_ST_CLR_S  30
/** SOC_ETM_MODEM_TASK_G2_ST_CLR : WT; bitpos: [31]; default: 0;
 *  Configures whether or not to clear MODEM_task_g2 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MODEM_TASK_G2_ST_CLR    (BIT(31))
#define SOC_ETM_MODEM_TASK_G2_ST_CLR_M  (SOC_ETM_MODEM_TASK_G2_ST_CLR_V << SOC_ETM_MODEM_TASK_G2_ST_CLR_S)
#define SOC_ETM_MODEM_TASK_G2_ST_CLR_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G2_ST_CLR_S  31

/** SOC_ETM_TASK_ST11_REG register
 *  Tasks trigger status register
 */
#define SOC_ETM_TASK_ST11_REG (DR_REG_SOC_ETM_BASE + 0x268)
/** SOC_ETM_MODEM_TASK_G3_ST : R/WTC/SS; bitpos: [0]; default: 0;
 *  Represents MODEM_task_g3 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_MODEM_TASK_G3_ST    (BIT(0))
#define SOC_ETM_MODEM_TASK_G3_ST_M  (SOC_ETM_MODEM_TASK_G3_ST_V << SOC_ETM_MODEM_TASK_G3_ST_S)
#define SOC_ETM_MODEM_TASK_G3_ST_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G3_ST_S  0
/** SOC_ETM_CORDIC_TASK_CAL_START_ST : R/WTC/SS; bitpos: [1]; default: 0;
 *  Represents CORDIC_task_cal_start trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_CORDIC_TASK_CAL_START_ST    (BIT(1))
#define SOC_ETM_CORDIC_TASK_CAL_START_ST_M  (SOC_ETM_CORDIC_TASK_CAL_START_ST_V << SOC_ETM_CORDIC_TASK_CAL_START_ST_S)
#define SOC_ETM_CORDIC_TASK_CAL_START_ST_V  0x00000001U
#define SOC_ETM_CORDIC_TASK_CAL_START_ST_S  1
/** SOC_ETM_ZERO_DET_TASK_START_ST : R/WTC/SS; bitpos: [2]; default: 0;
 *  Represents ZERO_DET_task_start trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_ZERO_DET_TASK_START_ST    (BIT(2))
#define SOC_ETM_ZERO_DET_TASK_START_ST_M  (SOC_ETM_ZERO_DET_TASK_START_ST_V << SOC_ETM_ZERO_DET_TASK_START_ST_S)
#define SOC_ETM_ZERO_DET_TASK_START_ST_V  0x00000001U
#define SOC_ETM_ZERO_DET_TASK_START_ST_S  2
/** SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST : R/WTC/SS; bitpos: [3]; default: 0;
 *  Represents SYSTIMER_task_cnt_upd0 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST    (BIT(3))
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_M  (SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_V << SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_S)
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_V  0x00000001U
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_S  3
/** SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST : R/WTC/SS; bitpos: [4]; default: 0;
 *  Represents SYSTIMER_task_cnt_upd1 trigger status.
 *  0: Not triggered
 *  1: Triggered
 */
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST    (BIT(4))
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_M  (SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_V << SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_S)
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_V  0x00000001U
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_S  4

/** SOC_ETM_TASK_ST11_CLR_REG register
 *  Tasks trigger status clear register
 */
#define SOC_ETM_TASK_ST11_CLR_REG (DR_REG_SOC_ETM_BASE + 0x26c)
/** SOC_ETM_MODEM_TASK_G3_ST_CLR : WT; bitpos: [0]; default: 0;
 *  Configures whether or not to clear MODEM_task_g3 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_MODEM_TASK_G3_ST_CLR    (BIT(0))
#define SOC_ETM_MODEM_TASK_G3_ST_CLR_M  (SOC_ETM_MODEM_TASK_G3_ST_CLR_V << SOC_ETM_MODEM_TASK_G3_ST_CLR_S)
#define SOC_ETM_MODEM_TASK_G3_ST_CLR_V  0x00000001U
#define SOC_ETM_MODEM_TASK_G3_ST_CLR_S  0
/** SOC_ETM_CORDIC_TASK_CAL_START_ST_CLR : WT; bitpos: [1]; default: 0;
 *  Configures whether or not to clear CORDIC_task_cal_start trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_CORDIC_TASK_CAL_START_ST_CLR    (BIT(1))
#define SOC_ETM_CORDIC_TASK_CAL_START_ST_CLR_M  (SOC_ETM_CORDIC_TASK_CAL_START_ST_CLR_V << SOC_ETM_CORDIC_TASK_CAL_START_ST_CLR_S)
#define SOC_ETM_CORDIC_TASK_CAL_START_ST_CLR_V  0x00000001U
#define SOC_ETM_CORDIC_TASK_CAL_START_ST_CLR_S  1
/** SOC_ETM_ZERO_DET_TASK_START_ST_CLR : WT; bitpos: [2]; default: 0;
 *  Configures whether or not to clear ZERO_DET_task_start trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_ZERO_DET_TASK_START_ST_CLR    (BIT(2))
#define SOC_ETM_ZERO_DET_TASK_START_ST_CLR_M  (SOC_ETM_ZERO_DET_TASK_START_ST_CLR_V << SOC_ETM_ZERO_DET_TASK_START_ST_CLR_S)
#define SOC_ETM_ZERO_DET_TASK_START_ST_CLR_V  0x00000001U
#define SOC_ETM_ZERO_DET_TASK_START_ST_CLR_S  2
/** SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_CLR : WT; bitpos: [3]; default: 0;
 *  Configures whether or not to clear SYSTIMER_task_cnt_upd0 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_CLR    (BIT(3))
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_CLR_M  (SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_CLR_V << SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_CLR_S)
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_CLR_V  0x00000001U
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD0_ST_CLR_S  3
/** SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_CLR : WT; bitpos: [4]; default: 0;
 *  Configures whether or not to clear SYSTIMER_task_cnt_upd1 trigger status.
 *  0: Invalid, No effect
 *  1: Clear
 */
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_CLR    (BIT(4))
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_CLR_M  (SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_CLR_V << SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_CLR_S)
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_CLR_V  0x00000001U
#define SOC_ETM_SYSTIMER_TASK_CNT_UPD1_ST_CLR_S  4

/** SOC_ETM_CLK_EN_REG register
 *  ETM clock enable register
 */
#define SOC_ETM_CLK_EN_REG (DR_REG_SOC_ETM_BASE + 0x270)
/** SOC_ETM_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to open register clock gate.
 *  0: Open the clock gate only when application writes registers
 *  1: Force open the clock gate for register
 */
#define SOC_ETM_CLK_EN    (BIT(0))
#define SOC_ETM_CLK_EN_M  (SOC_ETM_CLK_EN_V << SOC_ETM_CLK_EN_S)
#define SOC_ETM_CLK_EN_V  0x00000001U
#define SOC_ETM_CLK_EN_S  0

/** SOC_ETM_DATE_REG register
 *  ETM date register
 */
#define SOC_ETM_DATE_REG (DR_REG_SOC_ETM_BASE + 0x274)
/** SOC_ETM_DATE : R/W; bitpos: [27:0]; default: 38801984;
 *  Configures the version.
 */
#define SOC_ETM_DATE    0x0FFFFFFFU
#define SOC_ETM_DATE_M  (SOC_ETM_DATE_V << SOC_ETM_DATE_S)
#define SOC_ETM_DATE_V  0x0FFFFFFFU
#define SOC_ETM_DATE_S  0

#ifdef __cplusplus
}
#endif
